app/Controllers/Admin/AdminKurbanController.php

    public function index()
    {
        $model = new KurbanPackageModel();
        $data['packages'] = $model->orderBy('id', 'ASC')->findAll();
---
SELECT *
FROM `kurban_packages`
ORDER BY `id` ASC

    public function orders()
    {
        $orderModel = new \App\Models\KurbanOrderModel();

        $db = \Config\Database::connect();
        $builder = $db->table('kurban_orders');
        $builder->select('kurban_orders.*, kurban_packages.name as package_name');
        $builder->join('kurban_packages', 'kurban_packages.id = kurban_orders.package_id');
        $builder->orderBy('kurban_orders.id', 'DESC');
        $data['orders'] = $builder->get()->getResultArray();
---
SELECT `kurban_orders`.*, `kurban_packages`.`name` as `package_name`
FROM `kurban_orders`
JOIN `kurban_packages` ON `kurban_packages`.`id` = `kurban_orders`.`package_id`
ORDER BY `kurban_orders`.`id` DESC