app/Controllers/Admin/AdminRekeningController.php

SELECT *
FROM `bank_accounts`
ORDER BY `id` DESC
---
    public function index()
    {
        $model = new BankAccountModel();
        $data['accounts'] = $model->orderBy('id', 'DESC')->findAll();