app/Views/layout/main.php


                    <?php
                        $db = \Config\Database::connect();
                        $menuTentang = $db->table('pages')->where('type', 'tentang')->get()->getResultArray();
---
SELECT *
FROM `pages`
WHERE `type` = 'tentang'

                    </div>

                    <?php
                        $menuPrograms = $db->table('programs')->where('is_active', 1)->get()->getResultArray();
---
SELECT *
FROM `programs`
WHERE `is_active` = 1

                    </div>

                    <?php
                        $menuZakat = $db->table('pages')->where('type', 'zakat')->get()->getResultArray();
---
SELECT *
FROM `pages`
WHERE `type` = 'zakat'

                    </div>

                    <?php
                        $menuLayanan = $db->table('pages')->where('type', 'layanan')->get()->getResultArray();
---
SELECT *
FROM `pages`
WHERE `type` = 'layanan'