app/Helpers/setting_helper.php

    function get_setting($key, $default = '') {
        $db = \Config\Database::connect();
        $row = $db->table('settings')->where('setting_key', $key)->get()->getRow();
---
SELECT *
FROM `settings`
WHERE `setting_key` = 'manual_dana_tersalurkan'