app/Views/admin/layout/main.php

SELECT COUNT(*) AS `numrows`
FROM `contacts`
WHERE `status` = 'unread'
---
                        <span class="ml-3 font-medium">Kotak Masuk</span>
                        <?php
                            $db = \Config\Database::connect();
                            $unreadCount = $db->table('contacts')->where('status', 'unread')->countAllResults();