app/Controllers/Dashboard.php

    public function index(): string
    {
        $transactionModel = new \App\Models\TransactionModel();
        $settingModel = new \App\Models\SettingModel();

        // Get total amounts (Only SUCCESS status)
        $data = [
            'total_zakat_fitrah' => $transactionModel->where('status', 'success')->join('programs', 'programs.id = transactions.program_id')->where('programs.slug', 'zakat-fitrah')->selectSum('amount')->first()['amount'] ?? 0,
            'total_zakat_mal'    => $transactionModel->where('status', 'success')->join('programs', 'programs.id = transactions.program_id')->where('programs.slug', 'zakat-mal')->selectSum('amount')->first()['amount'] ?? 0,
            'total_zakat_profesi'=> $transactionModel->where('status', 'success')->join('programs', 'programs.id = transactions.program_id')->where('programs.slug', 'zakat-profesi')->selectSum('amount')->first()['amount'] ?? 0,
            'total_infaq'        => $transactionModel->where('status', 'success')->join('programs', 'programs.id = transactions.program_id')->where('programs.slug', 'infaq')->selectSum('amount')->first()['amount'] ?? 0,
            'total_sedekah'      => $transactionModel->where('status', 'success')->join('programs', 'programs.id = transactions.program_id')->where('programs.slug', 'sedekah')->selectSum('amount')->first()['amount'] ?? 0,
            'total_fidyah'       => $transactionModel->where('status', 'success')->join('programs', 'programs.id = transactions.program_id')->where('programs.slug', 'fidyah')->selectSum('amount')->first()['amount'] ?? 0,
            'total_zis'          => $transactionModel->where('status', 'success')->selectSum('amount')->first()['amount'] ?? 0,
            'total_pending'      => $transactionModel->where('status', 'pending')->selectSum('amount')->first()['amount'] ?? 0,
            'midtrans_status'    => $settingModel->getSetting('midtrans_enabled'),
            'recent_transactions' => $transactionModel->orderBy('created_at', 'DESC')->limit(10)->findAll(),
            'transaction_count'  => $transactionModel->countAllResults(),
---
SELECT SUM(`amount`) AS `amount`
FROM `transactions`
JOIN `programs` ON `programs`.`id` = `transactions`.`program_id`
WHERE `status` = 'success'
AND `programs`.`slug` = 'zakat-mal'
 LIMIT 1
SELECT SUM(`amount`) AS `amount`
FROM `transactions`
JOIN `programs` ON `programs`.`id` = `transactions`.`program_id`
WHERE `status` = 'success'
AND `programs`.`slug` = 'zakat-profesi'
 LIMIT 1
SELECT SUM(`amount`) AS `amount`
FROM `transactions`
JOIN `programs` ON `programs`.`id` = `transactions`.`program_id`
WHERE `status` = 'success'
AND `programs`.`slug` = 'infaq'
 LIMIT 1
SELECT SUM(`amount`) AS `amount`
FROM `transactions`
JOIN `programs` ON `programs`.`id` = `transactions`.`program_id`
WHERE `status` = 'success'
AND `programs`.`slug` = 'sedekah'
 LIMIT 1
SELECT SUM(`amount`) AS `amount`
FROM `transactions`
JOIN `programs` ON `programs`.`id` = `transactions`.`program_id`
WHERE `status` = 'success'
AND `programs`.`slug` = 'fidyah'
 LIMIT 1
SELECT SUM(`amount`) AS `amount`
FROM `transactions`
WHERE `status` = 'success'
 LIMIT 1
SELECT SUM(`amount`) AS `amount`
FROM `transactions`
WHERE `status` = 'pending'
 LIMIT 1
SELECT *
FROM `transactions`
ORDER BY `created_at` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `transactions`

    public function pages(): string
    {
        $pageModel = new \App\Models\PageModel();
        $data['pages'] = $pageModel->findAll();
---
SELECT *
FROM `pages`

    public function contacts(): string
    {
        $contactModel = new \App\Models\ContactModel();
        $data['contacts'] = $contactModel->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `contacts`
ORDER BY `created_at` DESC

    public function posts(): string
    {
        $postModel = new \App\Models\PostModel();
        $data['posts'] = $postModel->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `posts`
ORDER BY `created_at` DESC

    public function programs(): string
    {
        $programModel = new \App\Models\ProgramModel();
        $data['programs'] = $programModel->findAll();
---
SELECT *
FROM `programs`

    public function transactions(): string
    {
        $transactionModel = new \App\Models\TransactionModel();
        $data['transactions'] = $transactionModel->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `transactions`
ORDER BY `created_at` DESC

    public function settings(): string
    {
        $settingModel = new \App\Models\SettingModel();
        $data['settings'] = $settingModel->findAll();
---
SELECT *
FROM `settings`

    public function pageEdit($id)
    {
        $pageModel = new \App\Models\PageModel();
        $data['page'] = $pageModel->find($id);
---
SELECT *
FROM `pages`
WHERE `pages`.`id` = '1'