app/Controllers/Home.php

SELECT *
FROM `programs`
WHERE `is_active` = 1
---
    public function index(): string
    {
        $programModel = new \App\Models\ProgramModel();
        $postModel = new \App\Models\PostModel();
        $transactionModel = new \App\Models\TransactionModel();

        $allActive = $programModel->where('is_active', 1)->findAll();

SELECT *
FROM `posts`
WHERE `status` = 'published'
ORDER BY `created_at` DESC
 LIMIT 4
SELECT SUM(`amount`) AS `amount`
FROM `transactions`
WHERE `status` = 'success'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `status` = 'success'
---

        $data = [
            'programs' => $programs,
            'news'     => $postModel->where('status', 'published')->orderBy('created_at', 'DESC')->limit(4)->findAll(),
            'total_danaterkumpul' => ($transactionModel->where('status', 'success')->selectSum('amount')->first()['amount'] ?? 0) + (float)get_setting('manual_dana_tersalurkan', 0),
            'total_muzaki'        => $transactionModel->where('status', 'success')->countAllResults(),