app/Controllers/PageController.php

SELECT *
FROM `pages`
WHERE `slug` = 'profil-maziska-ppdi-pelindo'
 LIMIT 1
---
    public function tentang($segment) {
        $pageModel = new \App\Models\PageModel();
        $page = $pageModel->where('slug', $segment)->first();