app/Models/SettingModel.php

    public function getSetting($key) {
        $row = $this->where('setting_key', $key)->first();
---
SELECT *
FROM `settings`
WHERE `setting_key` = 'midtrans_enabled'
 LIMIT 1